# Handling NULL Values

In [30]:
import pandas as pd
import numpy as np

coffee = pd.read_csv("../warmup-data/coffee.csv")

In [31]:
coffee['Price'] = 4.99
coffee['Revenue'] = coffee['Units Sold'] * coffee['Price']

coffee.head()

         Day Coffee Type  Units Sold  Price  Revenue
0     Monday    Espresso          25   4.99   124.75
1     Monday       Latte          15   4.99    74.85
2    Tuesday    Espresso          30   4.99   149.70
3    Tuesday       Latte          20   4.99    99.80
4  Wednesday    Espresso          35   4.99   174.65

In [32]:
coffee.loc[[2,3],"Units Sold"] = np.nan
coffee.isna().sum()

Day            0
Coffee Type    0
Units Sold     2
Price          0
Revenue        0
dtype: int64

In [ ]:
# use mean() to fill NaN
coffee.fillna(coffee['Units Sold'].mean())

# OR

# use interpolate() to fill NaN
coffee['Units Sold'] = coffee['Units Sold'].interpolate()
coffee.head()

# OR

# just drop row that have NaN
coffee.dropna()
coffee = coffee.dropna(subset = ['Units Sold'])

          Day Coffee Type  Units Sold  Price  Revenue
0      Monday    Espresso   25.000000   4.99   124.75
1      Monday       Latte   15.000000   4.99    74.85
2     Tuesday    Espresso   21.666667   4.99   149.70
3     Tuesday       Latte   28.333333   4.99    99.80
4   Wednesday    Espresso   35.000000   4.99   174.65
5   Wednesday       Latte   25.000000   4.99   124.75
6    Thursday    Espresso   40.000000   4.99   199.60
7    Thursday       Latte   30.000000   4.99   149.70
8      Friday    Espresso   45.000000   4.99   224.55
9      Friday       Latte   35.000000   4.99   174.65
10   Saturday    Espresso   45.000000   4.99   224.55
11   Saturday       Latte   35.000000   4.99   174.65
12     Sunday    Espresso   45.000000   4.99   224.55
13     Sunday       Latte   35.000000   4.99   174.65